Repository: Penny7088/Localize-generate
Catalog: Locale/iOS/*.lproj/Localizable.strings
Languages: ar, de, fr, it, ja, pt, ru, tr

source: Can't save and revise
ar: Unable to save, probably because it contains dating, political, or other content that violates HelloTalk regulations. Plese revise it and try to save again.
de: Unable to save, probably because it contains dating, political, or other content that violates HelloTalk regulations. Plese revise it and try to save again.
fr: Unable to save, probably because it contains dating, political, or other content that violates HelloTalk regulations. Plese revise it and try to save again.
it: Impossibile salvare, probabilmente a causa di contenuti sessuali, politici o religiosi, bullismo, spam o qualsiasi altro contenuto che viola le regole della piattaforma. Si prega di ricontrollare e provare a salvare nuovamente.
ja: Unable to save, probably because it contains dating, political, or other content that violates HelloTalk regulations. Plese revise it and try to save again.
pt: Unable to save, probably because it contains dating, political, or other content that violates HelloTalk regulations. Plese revise it and try to save again.
ru: Unable to save, probably because it contains dating, political, or other content that violates HelloTalk regulations. Plese revise it and try to save again.
tr: Unable to save, probably because it contains dating, political, or other content that violates HelloTalk regulations. Plese revise it and try to save again.

source: My Follow
ar: My following
de: My following
fr: My following
it: Chi seguo
ja: My following
pt: My following
ru: My following
tr: My following

source: Report
it: Segnala

source: Report reason
ar: Reason
de: Begründung
fr: Reason
it: Motivo
ja: 理由
pt: Reason
ru: Reason
tr: Reason

source: Liar or ask for money
ar: Attempted/committed fraud
de: Attempted/committed fraud
fr: Attempted/committed fraud
it: Tentativo/frode commessa
ja: Attempted/committed fraud
pt: Attempted/committed fraud
ru: Attempted/committed fraud
tr: Attempted/committed fraud

source: Fake personal information
ar: Provided fake information
de: Provided fake information
fr: Provided fake information
it: Fornito informazioni false
ja: Provided fake information
pt: Provided fake information
ru: Provided fake information
tr: Provided fake information

source: Pornography
ar: Sent sexual content
de: Sent sexual content
fr: Sent sexual content
it: Contenuto sessuale inviato
ja: Sent sexual content
pt: Sent sexual content
ru: Sent sexual content
tr: Sent sexual content

source: Looking for dates or harassment
ar: Used the app for dating purposes
de: Used the app for dating purposes
fr: Used the app for dating purposes
it: L'app usato per appuntamenti
ja: Used the app for dating purposes
pt: Used the app for dating purposes
ru: Used the app for dating purposes
tr: Used the app for dating purposes

source: Abusive language
ar: Used abusive language
de: Used abusive language
fr: Used abusive language
it: Linguaggio offensivo usato
ja: Used abusive language
pt: Used abusive language
ru: Used abusive language
tr: Used abusive language

source: Spam
ar: Sent spam
de: Sent spam
fr: Sent spam
it: Spam inviato
ja: Sent spam
pt: Sent spam
ru: Sent spam
tr: Sent spam

source: Religion/Politics
ar: Sent religious/political content
de: Sent religious/political content
fr: Sent religious/political content
it: Inviati contenuti religiosi/politici
ja: Sent religious/political content
pt: Sent religious/political content
ru: Sent religious/political content
tr: Sent religious/political content

source: Other
it: Altro

source: Describe report reason
ar: What will you talk about it？
de: What will you talk about it？
fr: What will you talk about it？
it: Descrivi il motivo
ja: What will you talk about it？
pt: What will you talk about it？
ru: What will you talk about it？
tr: What will you talk about it？

source: Submit
it: Inserisci

source: Thank you for your report
it: Grazie per il resoconto

source: Report too frequent
ar: Reported too frequently, please try again later
de: Reported too frequently, please try again later
fr: Reported too frequently, please try again later
it: Segnalato troppo frequentemente. Si prega di provare più tardi.
ja: Reported too frequently, please try again later
pt: Reported too frequently, please try again later
ru: Reported too frequently, please try again later
tr: Reported too frequently, please try again later

source: Report failed
de: Melden fehlgeschlagen
it: Segnalazione fallita
ja: レポートに失敗しました

source: Leave stage raise hand again
ar: Do you want to leave the stage? You need to raise your hand again to return to the stage.
de: Do you want to leave the stage? You need to raise your hand again to return to the stage.
fr: Do you want to leave the stage? You need to raise your hand again to return to the stage.
it: Devi alzare di nuovo la mano per tornare sul palco. Vuoi lasciare il palco?
ja: Do you want to leave the stage? You need to raise your hand again to return to the stage.
pt: Do you want to leave the stage? You need to raise your hand again to return to the stage.
ru: Do you want to leave the stage? You need to raise your hand again to return to the stage.
tr: Do you want to leave the stage? You need to raise your hand again to return to the stage.

source: Cancel
ar: إلغاء
it: Annulla
tr: İptal

source: Yes
it: Sì

source: Minimize window
ar: تصغير النافذة
de: Fenster minimieren
fr: Minimize the window
it: Riduci la finestra
ja: ウィンドウの最小化
pt: Minimize the window
ru: Minimize the window
tr: Pencereyi küçült

source: Leave the room
ar: مغادرة الغرفة
de: Raum verlassen
it: Lascia la stanza
ja: 退出する
tr: odayı terk et

source: Close voice rm
ar: غلق
de: Close
fr: Close
it: Chiudi
ja: Close
pt: Close
ru: Close
tr: Kapat

source: Likes n Favorites
ar: الإعجابات أو المفضلات
de: Gefällt mir/Favoriten
fr: Likes/Favorites
it: Mi piace/Preferiti
ja: いいね/お気に入り
pt: Likes/Favorites
ru: Likes/Favorites
tr: Beğeniler/Favoriler

source: Someone favorite your post
ar: قام بإضافة منشورك إلى أشيائه المفضلة!
de: added your post to favorites
fr: added your post to favorites
it: ha aggiunto il tuo post ai suoi preferiti!
ja: added your post to favorites
pt: added your post to favorites
ru: added your post to favorites
tr: Gönderini favorilerine ekledi!

source: More
ar: المزيد
it: Altro
tr: Fazlası

source: Start chatting
ar: ابدأ الدردشة
de: Chatten beginnen
it: Inizia a chattare
ja: チャットを始める
tr: Sohbeti başlat

source: Allow recommendation
ar: توصيات المجموعة
de: Allow for recommendation
fr: Allow for recommendation
it: Raccomandazioni gruppo
ja: Allow for recommendation
pt: Allow for recommendation
ru: Allow for recommendation
tr: Grup önerileri

source: Pull to Refresh
ar: اسحب للتحديث...
it: Tira per ricaricare…
tr: Yenilemek için çekin…

source: Pull enter course
ar: اسحب لأسفل أكثر للوصول إلى الدورات
de: Pull down more to access courses
fr: Pull down more to access courses
it: Scorri di più per accedere ai corsi
ja: Pull down more to access courses
pt: Pull down more to access courses
ru: Pull down more to access courses
tr: Daha fazla Kurs için aşağıya in

source: Release to Refresh
ar: ارفع يدك للتحديث...
it: Rilascia per Ricaricare...
tr: Yenilemek için bırakın…

source: Recommended courses
ar: الدورات المقترحة
de: Empfohlene Kurse
it: Corsi raccomandati
ja: お勧めのレッスン
tr: Önerilen kurslar

source: Native lingual partner
ar: متحدث أصلي شريكًا للغة
de: Muttersprachlicher Partner
fr: Native language partner
it: Partner madrelingua
ja: ネイティブパートナー
pt: Native language partner
ru: Native language partner
tr: Ana dil partneri

source: Live learning
ar: بث مباشر تفاعلي للدروس
de: Interaktiver Live-Unterricht
fr: Interactive live lessons
it: Lezioni live interattive
ja: 生配信レッスン
pt: Interactive live lessons
ru: Interactive live lessons
tr: Etkileşimli canlı dersler

source: Listen you want
ar: استمع لما تحب!
de: Listen to what you want
fr: Listen to what you want
it: Ascolta ciò che ti piace!
ja: Listen to what you want
pt: Listen to what you want
ru: Listen to what you want
tr: Ne istersen onu dinle!

source: Hellowords
ar: كلمات
de: Wortschatz
fr: Vocabulary
it: Vocabolario
ja: 語彙
pt: Vocabulary
ru: Vocabulary
tr: Kelime bilgisi

source: Game like learning
ar: لعبة تعلم الكلمات
de: Spielähnliches Vokabellernen
fr: Game-like vocab learning
it: Apprendi i vocaboli come per gioco
ja: ゲーム感覚の語彙学習
pt: Game-like vocab learning
ru: Game-like vocab learning
tr: Oyun gibi kelime öğrenme

source: English times
ar: قراءة
de: Lesen
fr: Reading
it: Lettura
ja: リーディング
pt: Reading
ru: Reading
tr: Okuma

source: More reading
ar: المزيد من مصادر القراءة
de: Mehr Leseressourcen
fr: More reading resources
it: Più risorse per la lettura
ja: 他のリーディング資料
pt: More reading resources
ru: More reading resources
tr: Daha fazla okuma kaynağı

source: See who's online
ar: تحقق من المتصل
it: Vedi chi è online
tr: Kimin çevrimiçi olduğunu gör

source: Back to homepage
ar: الرجوع إلى الصفحة الرئيسية
de: Zurück zur Homepage
fr: Retour à l'accueil
it: Torna alla pagina iniziale
ja: ホームページに戻る
pt: Voltar a página inicial
ru: Вернуться на главную страницу
tr: Ana sayfaya dön

source: Live top tab
ar: بث مباشر
de: Streams
fr: Diffusions
it: Streams
ja: ライブ配信
pt: Evento ao vivo
ru: Прямые эфиры
tr: Yayınlar

source: Voice top tab
ar: غرفة الصوت
de: Sprache
fr: Voix
it: Vocale
ja: ボイス
pt: Voz
ru: Голосовая Комната
tr: Ses

source: Live bottom tab
ar: بث مباشر
de: Live
fr: En direct
it: Live
ja: ライブ配信
pt: Live
ru: Прямой эфир
tr: Canlı

source: Report（历史已有）
ar: بلغ
de: Melden
fr: Signaler
it: Segnala
ja: 通報する
pt: Reportar
ru: Сообщить
tr: Bildir

source: Bio (历史已有)
ar: سيرة
de: Selbstvorstellung
fr: Introduction
it: Biografia
ja: 自己紹介
pt: Biografia
ru: Информация о себе
tr: Biyografi

source: Visit profile
ar: زيارة الصفحة
de: Profil besuchen
fr: Visiter le profil
it: Visita profilo
ja: プロフィール訪問
pt: Visitar perfil
ru: Смотреть профиль
tr: Profili göz at

source: Follow（历史已有）
ar: تابِع
de: folgen
fr: S'abonner
it: Seguire
ja: フォロー
pt: Seguir
ru: Подписки
tr: Takip Et

source: Already followed（历史已有）
ar: لقد قمت بمتابعة المضيف
de: Du bist dem Host gefolgt
fr: Vous avez suivi l'hôte
it: Hai seguito l'host
ja: あなたはホストをフォローしました
pt: Você seguiu o anfitrião
ru: Вы подписаны на организатора
tr: Sunucuyu takip ettin

source: Remove user
ar: حذف
de: Entfernen
fr: Retirer
it: Rimuovi
ja: 退出させる
pt: Remover
ru: Удалить
tr: Kaldır

source: Thank you for your report（历史已有）
ar: شكرا لتقريرك
de: Danke für deine Berichtigung
fr: Merci pour ton rapport
it: Grazie per il resoconto
ja: ご通報ありがとうございます
pt: Obrigado pelo seu informe
ru: Спасибо за Вашу заявку
tr: Şikayet ettiğiniz için teşekkür ederiz

source: Live session ended toast（历史已有）
ar: لقد انتهى هذا البث المباشر
de: Dieses Live Event ist beendet
fr: Cet évènement en direct est terminé
it: Questo evento live è terminato
ja: このライブ配信イベントは終了しました
pt: Este evento ao vivo terminou
ru: Эта прямая трансляция закончилась
tr: Bu canlı etkinlik sona erdi

source: Follow the host live
ar: متابعة المضيف
de: Dem Host folgen
fr: Suivre l'hôte
it: Segui l'host
ja: ホストをフォローする
pt: Seguir o anfitrião
ru: Подписаться на bедущий
tr: Sunucuyu takip et

source: Following（历史已有）
ar: متابَعون
de: Folge Ich
fr: Abonnements
it: Seguiti
ja: フォロー
pt: Seguindo
ru: Подписки
tr: Takip Edilen

source: Leave（历史已有）
ar: نعم
de: Ja
fr: Oui
it: Si
ja: はい
pt: Sim
ru: Да
tr: Evet

source: Someone starts live
ar: بدأ %؜@ بث مباشر
de: %@ hat ein Live-Event gestartet
fr: %@ a commencé un évènement en direct!
it: %@ ha iniziato un evento live!
ja: %@はライブ配信イベントを始めました！
pt: %@ começou um evento ao vivo
ru: %@ начал(а) прямой эфир!
tr: %@ canlı bir etkinlik başlattı

source: Join the live stream（历史已有）
ar: انضم إلي البث المباشر الآن
de: Live Event beitreten
fr: Rejoignez l'évènement en direct
it: Unisciti all'evento live
ja: 配信イベントへ参加する
pt: Junte-se ao evento ao vivo
ru: Присоединиться к прямой трансляции
tr: Canlı etkinliğe katıl

source: Cant join the live
ar: لا يمكنك الانضمام إلى البث المباشر مرة أخرى!
de: Du kannst dem Live-Event nicht erneut beitreten!
fr: Vous ne pouvez pas rejoindre l'évènement en direct!
it: Non puoi rientrare nell'evento live!
ja: ライブ配信イベントに再参加できません！
pt: Você não pode voltar ao evento ao vivo!
ru: Вы не можете присоединиться к прямому эфиру!
tr: Canlı etkinliğe tekrar katılamazsın!

source: Failed turn on caption
ar: فشل في تشغيل التسميات التوضيحية. الرجاء المحاولة مرة أخرى.
de: Untertitel konnten nicht aktiviert werden. Bitte erneut versuchen.
fr: Echec lors de l'activation des sous-titres. Veuillez réessayer.
it: Attivazioe sottotitoli fallita. Si prega di riprovare.
ja: 字幕オンに失敗しました。再度試して下さい。
pt: Falha ao ativar as legendas. Por favor tente novamente.
ru: Не удалось включить субтитры. Пожалуйста, повторите попытку.
tr: Altyazılar açılamadı. Lütfen tekrar deneyin.

source: Failed turn off caption
ar: فشل في إيقاف التسميات التوضيحية. الرجاء المحاولة مرة أخرى.
de: Untertitel konnten nicht deaktiviert werden. Bitte erneut versuchen.
fr: Echec lors de la désctivation des sous-titres. Veuillez réessayer.
it: Disattivazione sottotitoli fallita. Si prega di riprovare.
ja: 字幕オフに失敗しました。再度試して下さい。
pt: Falha ao desativar as legendas. Por favor tente novamente.
ru: Не удалось выключить субтитры. Пожалуйста, повторите попытку.
tr: Altyazılar kapatılamadı. Lütfen tekrar deneyin.

source: Invitation open failed
ar: فشل في فتح الدعوات. الرجاء المحاولة مرة أخرى.
de: Einladungen konnten nicht geöffnet werden. Bitte erneut versuchen.
fr: Echec lors de l'ouverture de l'invitation. Veuillez réessayer.
it: Impossibile aprire l'invito. Si prega di riprovare.
ja: 招待の承認に失敗しました。再度試して下さい。
pt: Falha ao abrir o convite. Por favor tente novamente.
ru: Ну удалось открыть приглашение. Пожалуйста, повторите попытку.
tr: Davetiye açılamadı. Lütfen tekrar deneyin.

source: Invitation close failed
ar: فشل في اغلاق الدعوة. الرجاء المحاولة مرة أخرى.
de: Einladungen konnten nicht geschlossen werden. Bitte erneut versuchen.
fr: Echec lors de la fermeture de l'invitation. Veuillez réessayer.
it: Impossibile chiudere l'invito. Si prega di riprovare.
ja: 招待の却下に失敗しました。再度試して下さい。
pt: Falha ao fechar o convite. Por favor tente novamente.
ru: Не удалось закрыть приглашение. Пожалуйста, повторите попытку.
tr: Davetiye kapatılamadı. Lütfen tekrar deneyin.

source: No live event now
ar: ليس هناك أي بث مباشر متاح الآن.
de: Derzeit keine Live-Events verfügbar
fr: Pas d'évènements en direct disponibles en ce moment!
it: Nessun evento live disponibile al momento!
ja: 現在参加可能なライブ配信はありません。
pt: Nenhum evento ao vivo disponível agora!
ru: Сейчас нет доступных прямых эфиров!
tr: Şu anda mevcut canlı etkinlik yok!

source: No voice room now
ar: ليس هناك أي غرف صوتية متاحة الآن.
de: Derzeit keine Sprachräume verfügbar
fr: Pas de salles de chat disponibles en ce moment!
it: Nessuna Stanza Vocale disponibile al momento!
ja: 現在参加可能なボイスルームはありません。
pt: Nenhuma Sala de Voz disponível agora!
ru: Сейчас нет доступных Голосовых Комнат!
tr: Şu anda mevcut Sesli Konuşma Odası yok!

source: Voice rm closed（历史已有）
ar: غرفة الصوت مغلقة
de: Sprachraum wurde geschlossen
fr: La salle de chat est fermée
it: La Stanza Vocale è chiusa
ja: このボイスルームは終了しました
pt: A Sala de Voz está fechada
ru: Голосовая Комната закрыта
tr: Sesli Konuşma Odası kapandı

source: Follow host voice room（修改土耳其文案）
ar: متابعة المضيف
de: Dem Host folgen
fr: Suivre l'hôte
it: Segui l'host
ja: ホストをフォローする
pt: Siga o anfitrião
ru: Подписаться на bедущий
tr: Sunucuyu takip et.Sunucuyu takip et

source: Be Vip（补充多语言文案）
ar: انطلق الى VIP
de: Werde VIP
fr: PASSEZ VIP
it: DIVENTA VIP
ja: VIP会員になろう
pt: SEJA VIP
ru: Стать VIP
tr: VIP OL

source: Upgrade to Pro Member （历史已有）
ar: هذا هو VIP الميزات الحصرية، الترقية إلى VIP
de: Dies ist VIP-exklusive Features, ein Upgrade auf VIP
fr: Ceci est VIP caractéristiques exclusives, mise à niveau vers VIP
it: Si tratta di VIP caratteristiche esclusive, l'aggiornamento a VIP
ja: これはVIP排他的な機能である、VIPへのアップグレード
pt: Esta funcionalidade está disponível apenas para contas VIP. Mude agora para uma conta VIP.
ru: эксклюзивная VIP функция, обновление до VIP
tr: Bu VIP fonksiyonudur, VIP yükseltme

source: Host not turned on function
ar: لم يقم المضيف بتفعيل هذه الخاصية.
de: Der Host hat diese Funktion nicht aktiviert.
fr: L'hôte n'a pas activé cette fonctionnalité.
it: L'host non ha attivato questa funzione.
ja: ホストはこの機能を有効にしていません。
pt: O anfitrião não ativou essa função.
ru: Организатор не активировал эту функцию
tr: Sunucu bu işlevi etkinleştirmedi.

source: Followed Success
ar: تم المتابعة بنجاح
de: Erfolgreich gefolgt
fr: Suivi avec succès
it: Seguito con successo
ja: フォローしました
pt: Seguido com sucesso
ru: Подписка успешна
tr: Takip etme başarılı

source: web key（多语言用65行）
ar: متابعة المضيف
de: Dem Host folgen
fr: Suivre l'hôte
it: Segui l'host
ja: ホストをフォローする
pt: Seguir o anfitrião
ru: Подписаться на bедущий
tr: Sunucuyu takip et

source: web key（有多语言）
ar: لقد قمت بمتابعة المضيف
de: Du bist dem Host gefolgt
fr: Vous avez suivi l'hôte
it: Hai seguito l'host
ja: あなたはホストをフォローしました
pt: Você seguiu o anfitrião
ru: Вы подписаны на организатора
tr: Sunucuyu takip ettin

source: web key (多语言和移动端录入451已完成)
ar: أرسل إلى المضيف
de: An Host gesendet
fr: Envoyer à l'hôte
it: Inviato a host
ja: ホストに送る
pt: Enviado para o anfitrião
ru: Отправить организатору
tr: Sunucuya gönderildi

source: web key
ar: فشل في تشغيل التسميات التوضيحية. الرجاء المحاولة مرة أخرى.
de: Untertitel konnten nicht aktiviert werden. Bitte erneut versuchen.
fr: Echec lors de l'activation des sous-titres. Veuillez réessayer.
it: Attivazioe sottotitoli fallita. Si prega di riprovare.
ja: 字幕オンに失敗しました。再度試して下さい。
pt: Falha ao ativar as legendas. Por favor tente novamente.
ru: Не удалось включить субтитры. Пожалуйста, повторите попытку.
tr: Altyazılar açılamadı. Lütfen tekrar deneyin.

source: My Education
ar: مدرستي
de: Meine Schule
fr: Mon école
it: La mia scuola
ja: 学校名
pt: Minha escola
ru: Моя Школа
tr: Benim okulum

source: Audio video
ar: الصوت والفيديو
tr: Ses ve Vıdeo
